<template>
  <div style="height: 100%">
    <el-container style="height: 100%" direction="vertical">
      <MyHeader @changePermission="changePermission"></MyHeader>
      <NavMenu isActive="1" v-if="permission === 1 || permission === 0"></NavMenu>
      <DocNavMenu isActive="1" v-if="permission === 2"></DocNavMenu>
      <DocNavMenu1 isActive="1" v-if="permission === 4"></DocNavMenu1>
      <el-main style="background-color: #FFFFFF">
        <div style="height: 100%">
          <el-page-header @back="goBack" content="主页" style="margin-left: 168px">
          </el-page-header>

            <div class="title">
                {{this.title}}
            </div>
         <div style="display: flex;justify-content: left;margin-top: 50px;margin-left:300px;margin-right:300px">
            <span v-if="title==='医院公告'&&item==='1'">
              根据国务院办公厅关于2022年部分节假日安排的通知，结合我院实际情况，清明节，劳动节放假期间门诊安排如下：
              <br>
              清明节门诊安排：<br>
              2022年4月3日至4日（周日至周一）：停诊<br>
              2022年4月5日（周二）：上午半天门诊<br>

              特别提醒：<br>
              2022年4月2日（周六）：按周一门诊进行安排<br>

              劳动节门诊安排：<br>
              2022年4月30日至5月2日（周六至周一）：停诊<br>
              2022年5月3日至4日（周二至周三）：上午半天门诊<br>

              特别提醒：<br>
              2022年4月24日（周日）：按周二门诊进行安排<br>
              2022年5月7日（周六）：按周三门诊进行安排
            </span>
            <span v-if="title==='医院公告'&&item==='2'">
              随着复工潮的到来，大批人员返京，北京协和医院前来看诊的患者有所增加。面对就诊人员密集、就诊等待时间长等当前就医痛点，从“诊前病史采集系统” 到“预分检系统”，科大讯飞联合北京协和医院，不断探索创新，贡献智慧医疗“A.I.力量”。
              <br>
              “红黄绿”三色通行证助力医院无接触式管理和疏导；一键切换，英文版预分检系统就能“全呈现”；挂完号就能采集病史，节省医生问诊时间；还能自动同步到医生工作站，提升医生书写病历效率等。
            </span>
            <span v-if="title==='医院公告'&&item==='3'">
              北京协和医院神经科高晶教授团队在进行不同年龄组认知障碍（痴呆）疾病的生物标记物以及病理研究，这是一项国家的重点专项研究，获准接受逝者的脑组织捐赠，用于科学研究。患者逝世后的脑组织研究是认知障碍类疾病研究的关键，也是目前痴呆类疾病确定病因诊断最可靠的途径，可为相关疾病的发病机制研究和治疗靶点研发奠定基础。
              <br>
              获取脑组织的过程中，我们将充分尊重逝者，保护遗容完好。同时，我们的研究组也会以奋发图强的精神和严谨求真的努力来回报逝者和家属为医学事业做出的贡献。
              <br>
              如您或家属有意向参与这一项高尚的工作，请打开下方链接或扫描二维码填写信息，我们会及时与您联系进行更详细的交流。
            </span>
            <span v-if="title==='重大新闻'&&item==='1'">
              2022年3月15日，中华医学会临床流行病学和循证医学分会主任委员、北京协和医院感染内科刘晓清教授作为通讯作者的《中国制订/修订临床诊疗指南的指导原则（2022版）》在《中华医学杂志》正式发表。该指导原则的发布，为我国临床实践指南的高质量制订提供了循证方法和科学程序。
              <br>
              临床指南是规范医务人员诊疗行为、提升医疗质量、降低医疗成本的标准和依据，也是加速医学研究向临床实践转化的桥梁和枢纽。当前，我国年均发表的临床指南和专家共识已超千部，但整体来看质量良莠不齐，与国际指南存在差距。2020年，国家卫生健康委指定中华医学会临床流行病学和循证医学分会更新《中国制订/修订临床诊疗指南的指导原则》，刘晓清教授牵头来自兰州大学、北京大学、复旦大学、四川大学的多位学者，历时近2年组织编写了《中国制订/修订临床诊疗指南的指导原则（2022版）》（下称“2022版导则”）。
              <br>
              相较原先版本，2022版导则新增了四项重要内容：预先注册、撰写计划书、管理利益冲突与规范报告。
              <br>
              “预先注册”：在指南制订前，制定者应通过公开的注册平台（如国际指南注册与透明化平台）进行注册，注册信息包括指南题目、制订人员构成、制订方法和利益冲突等，从而有效避免指南的重复制订，促进不同机构和学科之间的合作。
              <br>
              “撰写计划书”：要求指南制订者说明指南的基本信息、背景、制订方法、证据、推荐意见和相关步骤等，进一步增加了指南制订过程的科学性和透明性。
              <br>
              “管理利益冲突”：要求每部指南都应该建立独立的指南利益冲突管理委员会，并制订相应的管理办法。所有参与指南制定的人员均应填写利益冲突声明表，在指南制订过程中及时更新利益冲突情况，在指南发表时公布声明表，以确保指南的公正性。
              <br>
              “规范报告”：应按统一标准撰写指南，以提高指南的全文完整性和透明度，增强指南推荐意见的可信度，同时也有助于使用者更好地理解和实施指南。
              <br>
              刘晓清教授表示，2022版导则将为全国医疗行业学会、协会等制订/修订指南、研究人员评价指南、医务人员使用指南、期刊论文发表指南等提供符合国际标准、适应中国实践的循证指导和建议。国家有关部门还将针对指南制订者开展相关培训，对已发表指南进行系统性评价，以推动2022版导则的成功落地和顺利实施。
            </span>
            <span v-if="title==='重大新闻'&&item==='2'">
              冬奥会，2月4日开幕，2月20日闭幕。北京这座双奥之城，在全球新冠疫情的笼罩之下，完成了一项几乎不可能完成的任务，最终交上了漂亮的答卷。
              <br>
              滑雪运动并不是我国体育的传统强项，高山滑雪项目也不为国人所熟悉。但是这项运动却被誉为冬奥会“皇冠上的明珠”，对运动员的身体素质有极高的要求，是速度与技巧的完美结合。
              <br>
              高山滑雪起源于欧洲，又称阿尔卑斯滑雪，运动员从高山之巅出发，滑降、回转、大回转、超级大回转，高速冲下陡峭的冰状雪坡面，极具观赏性。与欧洲国家相比，我国高山滑雪项目起步较晚，设备设施和保障措施等方面，均有一定差距，高山滑雪医疗保障更是白纸一张。高山滑雪是组织难度最高、复杂程度最大的冬季体育项目之一，同时也是一项危险系数极高的运动。据历届冬奥会的统计，运动员在训练和比赛中受伤的比例为15%-30%，其中重伤超过1%。国际雪联对高山滑雪的救治要求是4分钟到达现场，10～15分钟内完成处置。
              <br>
              高山滑雪医疗队的滑雪医生们，从2018年开始，经过4年筹备，实现了从0到1的突破：
              <br>
              第一次冬奥医疗保障全体人员全部通过高级心血管生命支持急救培训；
              <br>
              第一次设计并优化了高山滑雪救援背包物品和药品；
              <br>
              第一次设计并优化了高山滑雪救援伤情评估流程和转运流程；
              <br>
              第一次完成了雪道救援直升机配合转运伤员；
              <br>
              第一次承担了高山滑雪项目的大型国际赛事医疗保障任务；
              <br>
              第一次在冬奥会上实施闭环管理医疗救援。
              <br>
              这若干的“第一次”背后，是一群被冬奥精神感染、热爱冰雪运动的医务工作者们的努力与汗水。
            </span>
            <span v-if="title==='重大新闻'&&item==='3'">
              有这样一群患者，他们平均要经历4年以上才能得到确诊；有这样一类疾病，将近70%的医生表示不了解这类疾病。《2020中国罕见病综合社会调研》结果显示，漏诊误诊、治疗能力弱、药物缺乏是罕见病诊疗的世界性三大难题。
              <br>
              “通过罕见病多学科诊疗平台，罕见病患者在北京协和医院的确诊时间从4年变成了4周。”2022年2月26日，在全国罕见病诊疗协作网工作会议现场，北京协和医院院长张抒扬温柔而坚定的话语引发经久不息的掌声。这座101岁的医学殿堂在牵头全国罕见病诊疗协作网的同时，为国家构建了罕见病诊疗和研究体系，将破解罕见病防治难题的“中国方案”不断推进。
            </span>
            <span v-if="title==='医生说'&&item==='1'">
              3月21日是世界睡眠日，今年的主题是“良好睡眠 健康同行”。众所周知，睡眠紊乱不仅可以导致睡眠质量差，白天疲乏和嗜睡，还与许多疾病相关，如高血压、糖尿病、脑卒中等。而导致睡眠紊乱最常见的“幕后黑手”，就是阻塞性睡眠呼吸暂停（OSA），我们常说的打呼噜，也就是打鼾，是阻塞性睡眠呼吸暂停最突出的表现。“春眠不觉晓，夜来鼾声知多少”，且听北京协和医院呼吸与危重症医学科的专家们来一一揭晓。
              <br>
              大多数阻塞性睡眠呼吸暂停的病人都是由于打鼾来就诊的，但是并不是每个打鼾的人都有睡眠呼吸暂停。
              <br>
              打鼾是睡眠中非常常见的现象，大约40%的成年男性和24%的成年女性是习惯性打鼾者，很多人觉得这是“睡得香”。其实不然，轻度打鼾的人都没有什么感觉，仅仅觉得早上起来疲乏，精力不好。但是需要特别注意的是，如果晚上鼾声很大，且不规律，影响家人休息，反复出现睡眠中呼吸停止，夜间有窒息感或憋醒，睡眠质量差，醒来后仍然感到疲倦或精神不振，很难集中注意力，甚至是出现控制不住的睡意，这可能是由于患了严重的阻塞性睡眠呼吸暂停。
              <br>
              阻塞性睡眠呼吸暂停还可能出现晚上失眠、夜尿增多，早上头痛、头晕、咽痛，记忆下降、情绪改变以及性功能下降。
              <br>
              划重点：平卧位、饮酒、镇静安眠药、感冒或者过敏性鼻炎均可能导致或者加重打鼾。
            </span>
            <span v-if="title==='医生说'&&item==='2'">
              3月24日（明天）是世界防治结核病日，而今年正好是罗伯特·科赫先生发现结核分枝杆菌140周年。今年的宣传主题是Invest to End TB. Save Lives（生命至上 全力投入 终结结核），终结结核病离不开社会各界的共同努力。为什么结核病又名“浪漫病”？结核病就是肺结核吗？肺结核就一定会传染吗？今天，让我们一起来听听北京协和医院感染内科医生怎么说——
              <br>
              结核病是一种古老的疾病，最早可以追溯至7万年前，曾经被称为“白色瘟疫”。历史上至少有2亿人因为结核失去了生命。但在18~19世纪的欧洲，结核病被称为"浪漫病"，因患病者均体形消瘦、皮肤苍白、面色潮红，这就是大量文学作品在这一时期非常追捧的“玫瑰香腮”，美人失血的嘴唇与嘴角的血迹，以及因疾病折磨而流露出的忧郁气质，这种苍白艳丽的美，曾风靡欧洲一时。
              <br>
              然而掀开浪漫主义的面纱后，我们更多看到的却是潮红的脸颊，神经质的气质，弱不经风的体格和漫长的治疗过程。
              <br>
              终于，在1882年，人类文明终于迎来了划时代的发现：德国微生物学家罗伯特·科赫发现了导致结核病的元凶——结核分枝杆菌。为纪念这一重大发现，1995年底，世界卫生组织将每年的3月24日作为世界防治结核病日，而今年正是罗伯特·科赫先生发现结核分枝杆菌的140周年。
              <br>
              结核病是由结核分枝杆菌感染人体所致，几乎可以累及各个器官，表现多种多样，人称”万能模仿者”。
              <br>
              结核病中最高发的是肺结核，通过呼吸道传播。
              <br>
              所以结核病≠肺结核。除肺结核外，肺外结核也非常多见，人体除头发、牙齿和指甲外的任何组织和器官都可能受到结核分枝杆菌的侵犯。以北京协和医院这类综合医院为例，医院并未设有专门收治结核病患者的病房和专病门诊，但是每天却有很多需要确诊或排除结核病的患者，由于肺外结核病取得病原学诊断困难，需要结合临床、检验、影像、病理等综合诊断。
            </span>
            <span v-if="title==='医生说'&&item==='3'">
              怀胎十月，伴随着宝宝的第一声啼哭，与妈妈们身心相关的一系列忧虑也随之而来。分娩后出现的腰痛、会阴区疼痛、臀部疼痛、背痛等，对妈妈日常生活和母乳喂养都带来各种负面影响，应如何处理？孕期走形的身材及异常的体态如何尽早恢复？松弛的肌肉、变宽的骨盆怎样才能尽早复原？这些产后问题是如何产生的，又该如何解决？今天，北京协和医院康复医学科丛卉医生来为您逐一解答——
              <br>
              怀孕期间，在力学及激素的作用下，女性的肌肉和骨骼系统会发生一系列适应性变化，如腹部和盆底肌群的纤维逐渐延展，骨盆前方的连接部-耻骨联合会增宽，骶髂关节活动度增加，这些变化都是为了给宝宝提供更充足的生长空间，并为分娩提供更宽的通道。随着宝宝在子宫内体重增加，母亲的身体重心发生前移，为了代偿重心的变化，通常会出现腰椎前凸曲度增加、骨盆前倾程度增加的情况，这使得腰背部肌群的负担加重，甚至失衡。
              <br>
              这些身体的变化是在将近10个月的时间内慢慢发展形成的，虽然在产后没有了宝宝的重量负荷，但母亲身体的变化往往还需1-2年才会慢慢恢复。仍有相当数量的产妇不能完全恢复到孕前的水平，就会产生一系列临床上常见的腰痛、骨盆带疼痛以及盆底肌松弛导致漏尿等症状。只有在产后黄金时间，通过主动运动的方式，增强自身的肌肉力量、提高关节的稳定性和运动的协调性，才能科学有效地促进骨盆结构、腹部及盆底肌群恢复，更好地实现形体和功能恢复。这个康复过程其实就是在发达国家越来越普及的产后康复理念。  
              <br>
              只有通过科学、有效且及时的产后康复训练，才能让身体更快更好地恢复到孕前的健康状态，减少怀孕和分娩对身体造成的伤害。
              <br>
              通常，正常分娩的女性在产后6周内，就可以通过骨盆灵活性训练这类轻柔的主动运动来调动局部深层的肌肉，促进腰椎-骨盆区域的恢复。
              <br>
              骨盆灵活性训练：即躺在床上，双腿弯曲，想象腹部有一个时钟，指向头的方向为12点，指向脚的方向为6点，双腿尽量放松，主要收缩腹部、腰部和臀部的肌群，让骨盆沿着12点至6点方向缓慢活动，反复15次为一组，可以每天做2组。
            </span>
            </div>
        </div>
      </el-main>
    </el-container>
  </div>
</template>

<script>
import MyHeader from "@/components/MyHeader";
import NavMenu from "@/components/NavMenu";
import DocNavMenu from "@/components/DocNavMenu";
import DocNavMenu1 from "@/components/DocNavMenu1";

export default {
  name: "AboutView",
  components: {NavMenu, MyHeader, DocNavMenu, DocNavMenu1},
  data(){
      return{
        item:'',
        title:'',
        formVisible:false,
        detail:'',
        patientId:'',
        result:'',
        permission: 0
      }
  },
  created() {
    this.judgePermission()
  },
  mounted(){
      this.title=this.$route.query.title
      this.item=this.$route.query.item
  },
  methods:{
    judgePermission() {
      let user = localStorage.getItem("user") ? JSON.parse(localStorage.getItem("user")) : null
      if (user) {
        this.permission = user.permission
        if (this.permission === 3) {
          this.$router.push('/DoctorManage')
        }
      }
    },
    changePermission(permission) {
      this.permission = permission
    },
    goBack(){
      this.$router.push('/')
    },
    handleClick1(data) {
        this.detail=data
        this.formVisible=true
      },
  }
}
</script>

<style scoped>
.title{
      -webkit-text-size-adjust: 50%;
              /* font-family: SourceHanSansCN-Regular,Hiragino Sans GB,Microsoft YaHei,-apple-system-font,Helvetica Neue,sans-serif; */
              margin: 0;
              outline: none;
              /* box-sizing: border-box; */
              /* position: relative; */
              background-color: #008080;
              /* padding: 10px 0; */
              text-align: center;
              font-size: 20px;
              /* font-weight: 700; */
              color: #fff;
              margin-top: 50px;
}
</style>